src/ExchangePlans/ОбменУправлениеТорговлейWMS4/ОбменУправлениеТорговлейWMS4.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="d6091462-ada7-4031-9a25-8e797ed63907">
  <name>ОбменУправлениеТорговлейWMS4</name>
  <attributes>
    <name>URL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <comment>Для идентификации узла источника при обмене</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьПоклажедателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаВыгрузкиДокументов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

src/ExchangePlans/ОбменУправлениеТорговлейWMS4/Forms/ФормаУзла/Module.bsl
&НаСервере
Процедура ПроверитьСоединениеНаСервере()
	Попытка
		мОпределения = Новый WSОпределения(Объект.URL+"?wsdl", Объект.Пользователь, Объект.Пароль);
		Прокси = Новый WSПрокси(мОпределения,"http://www.axelot.ru/tms2_exchange/package", "axExchange", "axExchangeSoap");
		Прокси.Пользователь = Объект.Пользователь;
		Прокси.Пароль       = Объект.Пароль;

		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Соединение настроено корректно.'"));		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Соединение настроено не корректно. Ошибка: %1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		СобытиеЖурналаРегистрации = ОбменДаннымиWMS4.ВернутьСобытияЖурналаРегистрации();
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации[2], УровеньЖурналаРегистрации.Ошибка, , ,"при ПроверитьСоединениеНаСервере: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	ПроверитьСоединениеНаСервере();
КонецПроцедуры
